const phonebook = require('../phonebook');
// логика за четене
module.exports = {
    index: (req, res) => {
        // TODO: load index page
        let contacts = phonebook.getData();
        res.render('index', { contacts }); //зарежда папка view с фаил index.hbs, само че няма логика да зареди данни
        //Ние просто изкарваме статичен файл, в който няма никакви данни
    },
    addPhonebookPost: (req, res) => {
        console.log(req.body); //с-вото, което ще влязат данните, които потребителят е пратил
        // Когато дебъгнем, и в браузъра въведем в нов контакт име и номер, 
        //кликнме в/у бутона add-браузъра цикли, 
        //но тук в конзолата се появява обект от въведените данни в браузъра
        //защо зацикля в браузъра? Тъй като тук не сме дали отговор
        //получили сме заявката и пакета за обратна връзка, но сме казали в actiona нещо, което да влезе
        //в пакета за обратна връзка и ние, ако не го пратим, съответно 'куриера'-браузъра, стои и чака да получи отговор
        phonebook.saveContact(req.body.name, req.body.number);
        //трябва да върнем някакъв отговор
        //ние запазихме данните, но браузъра продължава да цикли
        // трябва в пакета за обратна връзка да сложим нещо-пренасочване към браузъра
        // върни се оттам, където си дошъл
        res.redirect('/');

        // TODO: add a phonebook object to the array
    }
};